➖ terraform fmt (number of updated = 0)
<details>
<summary>❌ terraform fmt</summary>

```patch
jenkins/ecs.tf
--- old/jenkins/ecs.tf
+++ new/jenkins/ecs.tf
@@ -5,7 +5,7 @@
 
 # Jenkins用のECSタスク定義
 resource "aws_ecs_task_definition" "jenkins_ecs" {
-  family                 = "jenkins"
+  family                   = "jenkins"
   network_mode             = "awsvpc"
   requires_compatibilities = ["FARGATE"]
   execution_role_arn       = aws_iam_role.jenkins_ecs_execution.arn

```

</details>
<details>
<summary>✅ terraform init</summary>

```

[0m[1mInitializing the backend...[0m

[0m[1mInitializing the backend...[0m

[0m[1mInitializing provider plugins...[0m
- Reusing previous version of hashicorp/aws from the dependency lock file

[0m[1mInitializing provider plugins...[0m
- Reusing previous version of hashicorp/aws from the dependency lock file
- Using previously-installed hashicorp/aws v5.26.0

[0m[1m[32mTerraform has been successfully initialized![0m[32m[0m
- Using previously-installed hashicorp/aws v5.24.0

[0m[1m[32mTerraform has been successfully initialized![0m[32m[0m

[0m[1mInitializing the backend...[0m

[0m[1mInitializing provider plugins...[0m
- Reusing previous version of hashicorp/aws from the dependency lock file
- Using previously-installed hashicorp/aws v5.25.0

[0m[1m[32mTerraform has been successfully initialized![0m[32m[0m
time=2023-12-01T00:28:31Z level=info msg=The stack at /home/runner/work/dcr/dcr/terragrunt/envs/dev will be processed in the following order for command init:
Group 1
- Module /home/runner/work/dcr/dcr/terragrunt/envs/dev/infrastructure
- Module /home/runner/work/dcr/dcr/terragrunt/envs/dev/network

Group 2
- Module /home/runner/work/dcr/dcr/terragrunt/envs/dev/jenkins



```

</details>
<details>
<summary>✅ terraform validate</summary>

```
[32m[1mSuccess![0m The configuration is valid.
[0m
[32m[1mSuccess![0m The configuration is valid.
[0m
[32m[1mSuccess![0m The configuration is valid.
[0m
time=2023-12-01T00:28:08Z level=info msg=The stack at /home/runner/work/dcr/dcr/terragrunt/envs/dev will be processed in the following order for command validate:
Group 1
- Module /home/runner/work/dcr/dcr/terragrunt/envs/dev/infrastructure
- Module /home/runner/work/dcr/dcr/terragrunt/envs/dev/network

Group 2
- Module /home/runner/work/dcr/dcr/terragrunt/envs/dev/jenkins



```

</details>
<details>
<summary>✅ terraform plan</summary>

```
[0m[1maws_ssm_parameter.google_oauth_client_id: Refreshing state... [id=/google_oauth/client_id][0m
[0m[1maws_ssm_parameter.google_oauth_client_secret: Refreshing state... [id=/google_oauth/client_secret][0m
[0m[1maws_eip.nat_eip: Refreshing state... [id=eipalloc-094704dea0ad92aa1][0m
[0m[1maws_vpc.dc_vpc: Refreshing state... [id=vpc-08d226a0c467df223][0m

[0m[1m[32mNo changes.[0m[1m Your infrastructure matches the configuration.[0m

[0mTerraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
[0m[1maws_route_table.private: Refreshing state... [id=rtb-07faa8df058119823][0m
[0m[1maws_internet_gateway.dc_igw: Refreshing state... [id=igw-0a16b53f2d8e795f2][0m
[0m[1maws_subnet.private["subnet2"]: Refreshing state... [id=subnet-08c2445671a97f257][0m
[0m[1maws_subnet.public["subnet1"]: Refreshing state... [id=subnet-0a17b57c5e96676a9][0m
[0m[1maws_security_group.dc_elb: Refreshing state... [id=sg-081148acfedf3f587][0m
[0m[1maws_subnet.public["subnet2"]: Refreshing state... [id=subnet-0d295a315480624b9][0m
[0m[1maws_route_table.public: Refreshing state... [id=rtb-0c20311ee7fa61393][0m
[0m[1maws_subnet.private["subnet1"]: Refreshing state... [id=subnet-05880325586bdcc7f][0m
[0m[1maws_route.igw: Refreshing state... [id=r-rtb-0c20311ee7fa613931080289494][0m
[0m[1maws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-049cb60bfb73a0840][0m
[0m[1maws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0df424679a67d2d66][0m
[0m[1maws_nat_gateway.nat_gateway: Refreshing state... [id=nat-06a3cd0a70406a06b][0m
[0m[1maws_lb.dc_elb: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:384081048358:loadbalancer/app/elb-dcr-dev/899e219328051b98][0m
[0m[1maws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-08daf324b6182356a][0m
[0m[1maws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-05b9eca3caf0baa31][0m
[0m[1maws_route.private_route_to_nat: Refreshing state... [id=r-rtb-07faa8df0581198231080289494][0m

[0m[1m[32mNo changes.[0m[1m Your infrastructure matches the configuration.[0m

[0mTerraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
[0m[1mdata.aws_ssm_parameter.google_oauth_client_secret: Reading...[0m[0m
[0m[1mdata.aws_ssm_parameter.google_oauth_client_id: Reading...[0m[0m
[0m[1mdata.aws_ssm_parameter.google_oauth_client_secret: Read complete after 1s [id=/google_oauth/client_secret][0m
[0m[1mdata.aws_ssm_parameter.google_oauth_client_id: Read complete after 1s [id=/google_oauth/client_id][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m
 [36m<=[0m read (data resources)[0m

Terraform will perform the following actions:

[1m  # data.aws_iam_policy_document.jenkins_efs[0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "aws_iam_policy_document" "jenkins_efs" {
      [32m+[0m[0m id   = (known after apply)
      [32m+[0m[0m json = (known after apply)

      [32m+[0m[0m statement {
          [32m+[0m[0m actions   = [
              [32m+[0m[0m "*",
            ]
          [32m+[0m[0m effect    = "Allow"
          [32m+[0m[0m resources = [
              [32m+[0m[0m (known after apply),
            ]

          [32m+[0m[0m condition {
              [32m+[0m[0m test     = "Bool"
              [32m+[0m[0m values   = [
                  [32m+[0m[0m "true",
                ]
              [32m+[0m[0m variable = "elasticfilesystem:AccessedViaMountTarget"
            }

          [32m+[0m[0m principals {
              [32m+[0m[0m identifiers = [
                  [32m+[0m[0m "*",
                ]
              [32m+[0m[0m type        = "AWS"
            }
        }
    }

[1m  # aws_cloudwatch_log_group.jenkins_ecs_log[0m will be created
[0m  [32m+[0m[0m resource "aws_cloudwatch_log_group" "jenkins_ecs_log" {
      [32m+[0m[0m arn               = (known after apply)
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m name              = "/ecs/jenkins-ecs-dev"
      [32m+[0m[0m name_prefix       = (known after apply)
      [32m+[0m[0m retention_in_days = 14
      [32m+[0m[0m skip_destroy      = false
      [32m+[0m[0m tags_all          = {
          [32m+[0m[0m "Environment" = "dev"
          [32m+[0m[0m "ManagedBy"   = "Terraform"
        }
    }

[1m  # aws_ecr_lifecycle_policy.jenkins_ecr_lifecycle_policy[0m will be created
[0m  [32m+[0m[0m resource "aws_ecr_lifecycle_policy" "jenkins_ecr_lifecycle_policy" {
      [32m+[0m[0m id          = (known after apply)
      [32m+[0m[0m policy      = jsonencode(
            {
              [32m+[0m[0m rules = [
                  [32m+[0m[0m {
                      [32m+[0m[0m action       = {
                          [32m+[0m[0m type = "expire"
                        }
                      [32m+[0m[0m description  = "Expire untagged images"
                      [32m+[0m[0m rulePriority = 1
                      [32m+[0m[0m selection    = {
                          [32m+[0m[0m countNumber = 1
                          [32m+[0m[0m countType   = "sinceImagePushed"
                          [32m+[0m[0m countUnit   = "days"
                          [32m+[0m[0m tagStatus   = "untagged"
                        }
                    },
                ]
            }
        )
      [32m+[0m[0m registry_id = (known after apply)
      [32m+[0m[0m repository  = "jenkins"
    }

[1m  # aws_ecr_repository.jenkins_ecr[0m will be created
[0m  [32m+[0m[0m resource "aws_ecr_repository" "jenkins_ecr" {
      [32m+[0m[0m arn                  = (known after apply)
      [32m+[0m[0m force_delete         = true
      [32m+[0m[0m id                   = (known after apply)
      [32m+[0m[0m image_tag_mutability = "MUTABLE"
      [32m+[0m[0m name                 = "jenkins"
      [32m+[0m[0m registry_id          = (known after apply)
      [32m+[0m[0m repository_url       = (known after apply)
      [32m+[0m[0m tags_all             = {
          [32m+[0m[0m "Environment" = "dev"
          [32m+[0m[0m "ManagedBy"   = "Terraform"
        }

      [32m+[0m[0m image_scanning_configuration {
          [32m+[0m[0m scan_on_push = true
        }
    }

[1m  # aws_ecs_cluster.jenkins_ecs[0m will be created
[0m  [32m+[0m[0m resource "aws_ecs_cluster" "jenkins_ecs" {
      [32m+[0m[0m arn      = (known after apply)
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m name     = "jenkins-cluster-dcr-dev"
      [32m+[0m[0m tags_all = {
          [32m+[0m[0m "Environment" = "dev"
          [32m+[0m[0m "ManagedBy"   = "Terraform"
        }
    }

[1m  # aws_ecs_service.jenkins_ecs[0m will be created
[0m  [32m+[0m[0m resource "aws_ecs_service" "jenkins_ecs" {
      [32m+[0m[0m cluster                            = (known after apply)
      [32m+[0m[0m deployment_maximum_percent         = 200
      [32m+[0m[0m deployment_minimum_healthy_percent = 100
      [32m+[0m[0m desired_count                      = 1
      [32m+[0m[0m enable_ecs_managed_tags            = false
      [32m+[0m[0m enable_execute_command             = false
      [32m+[0m[0m iam_role                           = (known after apply)
      [32m+[0m[0m id                                 = (known after apply)
      [32m+[0m[0m launch_type                        = "FARGATE"
      [32m+[0m[0m name                               = "jenkins-service-dcr-dev"
      [32m+[0m[0m platform_version                   = (known after apply)
      [32m+[0m[0m scheduling_strategy                = "REPLICA"
      [32m+[0m[0m tags_all                           = {
          [32m+[0m[0m "Environment" = "dev"
          [32m+[0m[0m "ManagedBy"   = "Terraform"
        }
      [32m+[0m[0m task_definition                    = (known after apply)
      [32m+[0m[0m triggers                           = (known after apply)
      [32m+[0m[0m wait_for_steady_state              = false

      [32m+[0m[0m load_balancer {
          [32m+[0m[0m container_name   = "jenkins"
          [32m+[0m[0m container_port   = 8080
          [32m+[0m[0m target_group_arn = (known after apply)
        }

      [32m+[0m[0m network_configuration {
          [32m+[0m[0m assign_public_ip = false
          [32m+[0m[0m security_groups  = (known after apply)
          [32m+[0m[0m subnets          = [
              [32m+[0m[0m "subnet-05880325586bdcc7f",
            ]
        }
    }

[1m  # aws_ecs_task_definition.jenkins_ecs[0m will be created
[0m  [32m+[0m[0m resource "aws_ecs_task_definition" "jenkins_ecs" {
      [32m+[0m[0m arn                      = (known after apply)
      [32m+[0m[0m arn_without_revision     = (known after apply)
      [32m+[0m[0m container_definitions    = (sensitive value)
      [32m+[0m[0m cpu                      = "2048"
      [32m+[0m[0m execution_role_arn       = (known after apply)
      [32m+[0m[0m family                   = "jenkins"
      [32m+[0m[0m id                       = (known after apply)
      [32m+[0m[0m memory                   = "4096"
      [32m+[0m[0m network_mode             = "awsvpc"
      [32m+[0m[0m requires_compatibilities = [
          [32m+[0m[0m "FARGATE",
        ]
      [32m+[0m[0m revision                 = (known after apply)
      [32m+[0m[0m skip_destroy             = false
      [32m+[0m[0m tags_all                 = {
          [32m+[0m[0m "Environment" = "dev"
          [32m+[0m[0m "ManagedBy"   = "Terraform"
        }
      [32m+[0m[0m task_role_arn            = (known after apply)

      [32m+[0m[0m volume {
          [32m+[0m[0m name = "jenkins-efs-dcr-dev"

          [32m+[0m[0m efs_volume_configuration {
              [32m+[0m[0m file_system_id          = (known after apply)
              [32m+[0m[0m root_directory          = "/"
              [32m+[0m[0m transit_encryption      = "ENABLED"
              [32m+[0m[0m transit_encryption_port = 2049

              [32m+[0m[0m authorization_config {
                  [32m+[0m[0m access_point_id = (known after apply)
                  [32m+[0m[0m iam             = "ENABLED"
                }
            }
        }
    }

[1m  # aws_efs_access_point.jenkins_efs[0m will be created
[0m  [32m+[0m[0m resource "aws_efs_access_point" "jenkins_efs" {
      [32m+[0m[0m arn             = (known after apply)
      [32m+[0m[0m file_system_arn = (known after apply)
      [32m+[0m[0m file_system_id  = (known after apply)
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m owner_id        = (known after apply)
      [32m+[0m[0m tags_all        = {
          [32m+[0m[0m "Environment" = "dev"
          [32m+[0m[0m "ManagedBy"   = "Terraform"
        }

      [32m+[0m[0m root_directory {
          [32m+[0m[0m path = "/jenkins_home"

          [32m+[0m[0m creation_info {
              [32m+[0m[0m owner_gid   = 1000
              [32m+[0m[0m owner_uid   = 1000
              [32m+[0m[0m permissions = "755"
            }
        }
    }

[1m  # aws_efs_file_system.jenkins_efs[0m will be created
[0m  [32m+[0m[0m resource "aws_efs_file_system" "jenkins_efs" {
      [32m+[0m[0m arn                     = (known after apply)
      [32m+[0m[0m availability_zone_id    = (known after apply)
      [32m+[0m[0m availability_zone_name  = (known after apply)
      [32m+[0m[0m creation_token          = "jenkins-ecs-dev"
      [32m+[0m[0m dns_name                = (known after apply)
      [32m+[0m[0m encrypted               = true
      [32m+[0m[0m id                      = (known after apply)
      [32m+[0m[0m kms_key_id              = (known after apply)
      [32m+[0m[0m name                    = (known after apply)
      [32m+[0m[0m number_of_mount_targets = (known after apply)
      [32m+[0m[0m owner_id                = (known after apply)
      [32m+[0m[0m performance_mode        = "generalPurpose"
      [32m+[0m[0m size_in_bytes           = (known after apply)
      [32m+[0m[0m tags                    = {
          [32m+[0m[0m "Name" = "jenkins-efs-dcr-dev"
        }
      [32m+[0m[0m tags_all                = {
          [32m+[0m[0m "Environment" = "dev"
          [32m+[0m[0m "ManagedBy"   = "Terraform"
          [32m+[0m[0m "Name"        = "jenkins-efs-dcr-dev"
        }
      [32m+[0m[0m throughput_mode         = "bursting"

      [32m+[0m[0m lifecycle_policy {
          [32m+[0m[0m transition_to_ia = "AFTER_1_DAY"
        }
    }

[1m  # aws_efs_file_system_policy.jenkins_efs[0m will be created
[0m  [32m+[0m[0m resource "aws_efs_file_system_policy" "jenkins_efs" {
      [32m+[0m[0m bypass_policy_lockout_safety_check = false
      [32m+[0m[0m file_system_id                     = (known after apply)
      [32m+[0m[0m id                                 = (known after apply)
      [32m+[0m[0m policy                             = (known after apply)
    }

[1m  # aws_efs_mount_target.jenkins_efs[0m will be created
[0m  [32m+[0m[0m resource "aws_efs_mount_target" "jenkins_efs" {
      [32m+[0m[0m availability_zone_id   = (known after apply)
      [32m+[0m[0m availability_zone_name = (known after apply)
      [32m+[0m[0m dns_name               = (known after apply)
      [32m+[0m[0m file_system_arn        = (known after apply)
      [32m+[0m[0m file_system_id         = (known after apply)
      [32m+[0m[0m id                     = (known after apply)
      [32m+[0m[0m ip_address             = (known after apply)
      [32m+[0m[0m mount_target_dns_name  = (known after apply)
      [32m+[0m[0m network_interface_id   = (known after apply)
      [32m+[0m[0m owner_id               = (known after apply)
      [32m+[0m[0m security_groups        = (known after apply)
      [32m+[0m[0m subnet_id              = "subnet-05880325586bdcc7f"
    }

[1m  # aws_iam_policy.jenkins_ecr_read_only_access[0m will be created
[0m  [32m+[0m[0m resource "aws_iam_policy" "jenkins_ecr_read_only_access" {
      [32m+[0m[0m arn         = (known after apply)
      [32m+[0m[0m description = "Policy to allow read-only access to a specific ECR repository"
      [32m+[0m[0m id          = (known after apply)
      [32m+[0m[0m name        = "ECRReadOnlyAccessForJenkins"
      [32m+[0m[0m name_prefix = (known after apply)
      [32m+[0m[0m path        = "/"
      [32m+[0m[0m policy      = (known after apply)
      [32m+[0m[0m policy_id   = (known after apply)
      [32m+[0m[0m tags_all    = {
          [32m+[0m[0m "Environment" = "dev"
          [32m+[0m[0m "ManagedBy"   = "Terraform"
        }
    }

[1m  # aws_iam_policy.jenkins_ecs_log[0m will be created
[0m  [32m+[0m[0m resource "aws_iam_policy" "jenkins_ecs_log" {
      [32m+[0m[0m arn         = (known after apply)
      [32m+[0m[0m description = "IAM policy for ECS task to write logs to CloudWatch Logs"
      [32m+[0m[0m id          = (known after apply)
      [32m+[0m[0m name        = "jenkins-ecs-task-logs-policy-dev"
      [32m+[0m[0m name_prefix = (known after apply)
      [32m+[0m[0m path        = "/"
      [32m+[0m[0m policy      = jsonencode(
            {
              [32m+[0m[0m Statement = [
                  [32m+[0m[0m {
                      [32m+[0m[0m Action   = [
                          [32m+[0m[0m "logs:CreateLogGroup",
                          [32m+[0m[0m "logs:CreateLogStream",
                          [32m+[0m[0m "logs:PutLogEvents",
                        ]
                      [32m+[0m[0m Effect   = "Allow"
                      [32m+[0m[0m Resource = "arn:aws:logs:*:*:log-group:/ecs/jenkins-ecs-dev:*"
                    },
                ]
              [32m+[0m[0m Version   = "2012-10-17"
            }
        )
      [32m+[0m[0m policy_id   = (known after apply)
      [32m+[0m[0m tags_all    = {
          [32m+[0m[0m "Environment" = "dev"
          [32m+[0m[0m "ManagedBy"   = "Terraform"
        }
    }

[1m  # aws_iam_policy.jenkins_efs_mount[0m will be created
[0m  [32m+[0m[0m resource "aws_iam_policy" "jenkins_efs_mount" {
      [32m+[0m[0m arn         = (known after apply)
      [32m+[0m[0m id          = (known after apply)
      [32m+[0m[0m name        = "jenkins-task-policy-dev"
      [32m+[0m[0m name_prefix = (known after apply)
      [32m+[0m[0m path        = "/"
      [32m+[0m[0m policy      = (known after apply)
      [32m+[0m[0m policy_id   = (known after apply)
      [32m+[0m[0m tags_all    = {
          [32m+[0m[0m "Environment" = "dev"
          [32m+[0m[0m "ManagedBy"   = "Terraform"
        }
    }

[1m  # aws_iam_role.jenkins_ecs_execution[0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role" "jenkins_ecs_execution" {
      [32m+[0m[0m arn                   = (known after apply)
      [32m+[0m[0m assume_role_policy    = jsonencode(
            {
              [32m+[0m[0m Statement = [
                  [32m+[0m[0m {
                      [32m+[0m[0m Action    = "sts:AssumeRole"
                      [32m+[0m[0m Effect    = "Allow"
                      [32m+[0m[0m Principal = {
                          [32m+[0m[0m Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              [32m+[0m[0m Version   = "2012-10-17"
            }
        )
      [32m+[0m[0m create_date           = (known after apply)
      [32m+[0m[0m force_detach_policies = false
      [32m+[0m[0m id                    = (known after apply)
      [32m+[0m[0m managed_policy_arns   = (known after apply)
      [32m+[0m[0m max_session_duration  = 3600
      [32m+[0m[0m name                  = "jenkins-ecs-execution-dev"
      [32m+[0m[0m name_prefix           = (known after apply)
      [32m+[0m[0m path                  = "/"
      [32m+[0m[0m tags_all              = {
          [32m+[0m[0m "Environment" = "dev"
          [32m+[0m[0m "ManagedBy"   = "Terraform"
        }
      [32m+[0m[0m unique_id             = (known after apply)
    }

[1m  # aws_iam_role.jenkins_task_execution[0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role" "jenkins_task_execution" {
      [32m+[0m[0m arn                   = (known after apply)
      [32m+[0m[0m assume_role_policy    = jsonencode(
            {
              [32m+[0m[0m Statement = [
                  [32m+[0m[0m {
                      [32m+[0m[0m Action    = "sts:AssumeRole"
                      [32m+[0m[0m Effect    = "Allow"
                      [32m+[0m[0m Principal = {
                          [32m+[0m[0m Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              [32m+[0m[0m Version   = "2012-10-17"
            }
        )
      [32m+[0m[0m create_date           = (known after apply)
      [32m+[0m[0m force_detach_policies = false
      [32m+[0m[0m id                    = (known after apply)
      [32m+[0m[0m managed_policy_arns   = (known after apply)
      [32m+[0m[0m max_session_duration  = 3600
      [32m+[0m[0m name                  = "jenkins-task-execution-dev"
      [32m+[0m[0m name_prefix           = (known after apply)
      [32m+[0m[0m path                  = "/"
      [32m+[0m[0m tags_all              = {
          [32m+[0m[0m "Environment" = "dev"
          [32m+[0m[0m "ManagedBy"   = "Terraform"
        }
      [32m+[0m[0m unique_id             = (known after apply)
    }

[1m  # aws_iam_role_policy_attachment.jenkins_ecr_read_only_access[0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role_policy_attachment" "jenkins_ecr_read_only_access" {
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m policy_arn = (known after apply)
      [32m+[0m[0m role       = "jenkins-ecs-execution-dev"
    }

[1m  # aws_iam_role_policy_attachment.jenkins_ecs_log[0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role_policy_attachment" "jenkins_ecs_log" {
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m policy_arn = (known after apply)
      [32m+[0m[0m role       = "jenkins-ecs-execution-dev"
    }

[1m  # aws_iam_role_policy_attachment.jenkins_efs_mount[0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role_policy_attachment" "jenkins_efs_mount" {
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m policy_arn = (known after apply)
      [32m+[0m[0m role       = "jenkins-task-execution-dev"
    }

[1m  # aws_lb_listener.jenkins_elb[0m will be created
[0m  [32m+[0m[0m resource "aws_lb_listener" "jenkins_elb" {
      [32m+[0m[0m arn               = (known after apply)
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m load_balancer_arn = "arn:aws:elasticloadbalancing:ap-northeast-1:384081048358:loadbalancer/app/elb-dcr-dev/899e219328051b98"
      [32m+[0m[0m port              = 80
      [32m+[0m[0m protocol          = "HTTP"
      [32m+[0m[0m ssl_policy        = (known after apply)
      [32m+[0m[0m tags_all          = {
          [32m+[0m[0m "Environment" = "dev"
          [32m+[0m[0m "ManagedBy"   = "Terraform"
        }

      [32m+[0m[0m default_action {
          [32m+[0m[0m order = (known after apply)
          [32m+[0m[0m type  = "fixed-response"

          [32m+[0m[0m fixed_response {
              [32m+[0m[0m content_type = "text/plain"
              [32m+[0m[0m status_code  = "403"
            }
        }
    }

[1m  # aws_lb_listener_rule.jenkins_elb[0m will be created
[0m  [32m+[0m[0m resource "aws_lb_listener_rule" "jenkins_elb" {
      [32m+[0m[0m arn          = (known after apply)
      [32m+[0m[0m id           = (known after apply)
      [32m+[0m[0m listener_arn = (known after apply)
      [32m+[0m[0m priority     = 100
      [32m+[0m[0m tags_all     = {
          [32m+[0m[0m "Environment" = "dev"
          [32m+[0m[0m "ManagedBy"   = "Terraform"
        }

      [32m+[0m[0m action {
          [32m+[0m[0m order            = (known after apply)
          [32m+[0m[0m target_group_arn = (known after apply)
          [32m+[0m[0m type             = "forward"
        }

      [32m+[0m[0m condition {
          [32m+[0m[0m path_pattern {
              [32m+[0m[0m values = [
                  [32m+[0m[0m "/jenkins*",
                ]
            }
        }
    }

[1m  # aws_lb_target_group.jenkins_elb[0m will be created
[0m  [32m+[0m[0m resource "aws_lb_target_group" "jenkins_elb" {
      [32m+[0m[0m arn                                = (known after apply)
      [32m+[0m[0m arn_suffix                         = (known after apply)
      [32m+[0m[0m connection_termination             = (known after apply)
      [32m+[0m[0m deregistration_delay               = "300"
      [32m+[0m[0m id                                 = (known after apply)
      [32m+[0m[0m ip_address_type                    = (known after apply)
      [32m+[0m[0m lambda_multi_value_headers_enabled = false
      [32m+[0m[0m load_balancing_algorithm_type      = (known after apply)
      [32m+[0m[0m load_balancing_cross_zone_enabled  = (known after apply)
      [32m+[0m[0m name                               = "jenkins-tg-dev"
      [32m+[0m[0m name_prefix                        = (known after apply)
      [32m+[0m[0m port                               = 8080
      [32m+[0m[0m preserve_client_ip                 = (known after apply)
      [32m+[0m[0m protocol                           = "HTTP"
      [32m+[0m[0m protocol_version                   = (known after apply)
      [32m+[0m[0m proxy_protocol_v2                  = false
      [32m+[0m[0m slow_start                         = 0
      [32m+[0m[0m tags_all                           = {
          [32m+[0m[0m "Environment" = "dev"
          [32m+[0m[0m "ManagedBy"   = "Terraform"
        }
      [32m+[0m[0m target_type                        = "ip"
      [32m+[0m[0m vpc_id                             = "vpc-08d226a0c467df223"

      [32m+[0m[0m health_check {
          [32m+[0m[0m enabled             = true
          [32m+[0m[0m healthy_threshold   = 2
          [32m+[0m[0m interval            = 30
          [32m+[0m[0m matcher             = "200-299,403"
          [32m+[0m[0m path                = "/jenkins/"
          [32m+[0m[0m port                = "traffic-port"
          [32m+[0m[0m protocol            = "HTTP"
          [32m+[0m[0m timeout             = 10
          [32m+[0m[0m unhealthy_threshold = 5
        }
    }

[1m  # aws_security_group.jenkins_ecs[0m will be created
[0m  [32m+[0m[0m resource "aws_security_group" "jenkins_ecs" {
      [32m+[0m[0m arn                    = (known after apply)
      [32m+[0m[0m description            = "Allow Jenkins"
      [32m+[0m[0m egress                 = [
          [32m+[0m[0m {
              [32m+[0m[0m cidr_blocks      = [
                  [32m+[0m[0m "0.0.0.0/0",
                ]
              [32m+[0m[0m description      = ""
              [32m+[0m[0m from_port        = 0
              [32m+[0m[0m ipv6_cidr_blocks = []
              [32m+[0m[0m prefix_list_ids  = []
              [32m+[0m[0m protocol         = "-1"
              [32m+[0m[0m security_groups  = []
              [32m+[0m[0m self             = false
              [32m+[0m[0m to_port          = 0
            },
        ]
      [32m+[0m[0m id                     = (known after apply)
      [32m+[0m[0m ingress                = [
          [32m+[0m[0m {
              [32m+[0m[0m cidr_blocks      = [
                  [32m+[0m[0m "0.0.0.0/0",
                ]
              [32m+[0m[0m description      = ""
              [32m+[0m[0m from_port        = 8080
              [32m+[0m[0m ipv6_cidr_blocks = []
              [32m+[0m[0m prefix_list_ids  = []
              [32m+[0m[0m protocol         = "tcp"
              [32m+[0m[0m security_groups  = []
              [32m+[0m[0m self             = false
              [32m+[0m[0m to_port          = 8080
            },
        ]
      [32m+[0m[0m name                   = "jenkins-sg-dcr-dev"
      [32m+[0m[0m name_prefix            = (known after apply)
      [32m+[0m[0m owner_id               = (known after apply)
      [32m+[0m[0m revoke_rules_on_delete = false
      [32m+[0m[0m tags_all               = {
          [32m+[0m[0m "Environment" = "dev"
          [32m+[0m[0m "ManagedBy"   = "Terraform"
        }
      [32m+[0m[0m vpc_id                 = "vpc-08d226a0c467df223"
    }

[1m  # aws_security_group.jenkins_efs[0m will be created
[0m  [32m+[0m[0m resource "aws_security_group" "jenkins_efs" {
      [32m+[0m[0m arn                    = (known after apply)
      [32m+[0m[0m description            = "Managed by Terraform"
      [32m+[0m[0m egress                 = (known after apply)
      [32m+[0m[0m id                     = (known after apply)
      [32m+[0m[0m ingress                = [
          [32m+[0m[0m {
              [32m+[0m[0m cidr_blocks      = []
              [32m+[0m[0m description      = ""
              [32m+[0m[0m from_port        = 2049
              [32m+[0m[0m ipv6_cidr_blocks = []
              [32m+[0m[0m prefix_list_ids  = []
              [32m+[0m[0m protocol         = "tcp"
              [32m+[0m[0m security_groups  = (known after apply)
              [32m+[0m[0m self             = false
              [32m+[0m[0m to_port          = 2049
            },
        ]
      [32m+[0m[0m name                   = "jenkins-efs-dev"
      [32m+[0m[0m name_prefix            = (known after apply)
      [32m+[0m[0m owner_id               = (known after apply)
      [32m+[0m[0m revoke_rules_on_delete = false
      [32m+[0m[0m tags_all               = {
          [32m+[0m[0m "Environment" = "dev"
          [32m+[0m[0m "ManagedBy"   = "Terraform"
        }
      [32m+[0m[0m vpc_id                 = "vpc-08d226a0c467df223"
    }

[1mPlan:[0m 23 to add, 0 to change, 0 to destroy.
[0m
Changes to Outputs:
  [32m+[0m[0m jenkins_url = "http://elb-dcr-dev-887804881.ap-northeast-1.elb.amazonaws.com/jenkins/"
time=2023-12-01T00:28:40Z level=info msg=The stack at /home/runner/work/dcr/dcr/terragrunt/envs/dev will be processed in the following order for command plan:
Group 1
- Module /home/runner/work/dcr/dcr/terragrunt/envs/dev/infrastructure
- Module /home/runner/work/dcr/dcr/terragrunt/envs/dev/network

Group 2
- Module /home/runner/work/dcr/dcr/terragrunt/envs/dev/jenkins



```

</details>